Classes | Typedefs | Enumerations | Functions
Design Options
Functions related to the Design Options, Design Option Combinations, and Design Option - View connection. More...
 Classes
class  | ACAPI::DesignOptions::DesignOption
A class that represents the design option. More...
class  | ACAPI::DesignOptions::DesignOptionCombination
A class that represents the design option combination of the view settings. More...
class  | ACAPI::DesignOptions::DesignOptionCombinationViewSettings
A class that represents the design option combination settings of a view. More...
struct  | ACAPI::DesignOptions::DesignOptionCombinationViewSettings::MainModelOnly
A type of combination that has no design option connected to it, and only shows the main model. More...
struct  | ACAPI::DesignOptions::DesignOptionCombinationViewSettings::Standard
A type of combination for which the user has selected a specific set of design options. More...
struct  | ACAPI::DesignOptions::DesignOptionCombinationViewSettings::Custom
A type of combination that the user has modified, but did not give an explicit name. More...
struct  | ACAPI::DesignOptions::DesignOptionCombinationViewSettings::Missing
A type of combination that does not exist, and was previously deleted. More...
class  | ACAPI::DesignOptions::DesignOptionManager
A class that contains design option related functions. More...
class  | ACAPI::DesignOptions::DesignOptionSet
A class that represents the design option set. More...
class  | ACAPI::DesignOptions::DesignOptionsManipulationRightsChecker
A class to check manipulation rights for Design Options. More...
struct  | ACAPI::DesignOptions::MissingDesignOption
This expresses that an element had some design option linked to it, but this is missing now. This situation can occur for example if in teamwork, user A links an element to a design option, and meanwhile user B deletes this design option. More...
struct  | ACAPI::DesignOptions::MainModelDesignOption
This expresses that an element is not linked to any design option, therefore this element is in the Main Model. More...
class  | ACAPI::DesignOptions::HotlinkDesignOptionTable
A class that represents the design option structure of a hotlink or node. More...
 Typedefs
 using  | ACAPI::DesignOptions::DesignOptionCombinationViewSettings::Status = std::variant<MainModelOnly, Standard, Custom, Missing>
Status of the view settings.
 using  | ACAPI::DesignOptions::ElemDesignOptionStatus = std::variant<DesignOption, MissingDesignOption, MainModelDesignOption>
Status of the element's design option.
 Enumerations
enum class  | ACAPI::DesignOptions::HotlinkDesignOptionTable::FilterMode { MainModelOnly = 0 , FilterByOptions = 1 , FilterByCombination = 2 }
The mode how the hotlink instance's elements are filtered by Design Options. Only the filtered elements are visible.
 Functions
Result< DesignOptionManager >  | ACAPI::DesignOptions::CreateDesignOptionManager ()
A function to create design option manager instance, that lets you query and manipulate design option related data.
static std::optional< Error >  | ACAPI::DesignOptions::DesignOptionsManipulationRightsChecker::CheckProjectExistanceAndWindowType ()
static std::optional< Error >  | ACAPI::DesignOptions::DesignOptionsManipulationRightsChecker::CheckCreationRights ()
static std::optional< Error >  | ACAPI::DesignOptions::DesignOptionsManipulationRightsChecker::CheckModificationAndDeletionRights (const GS::Guid &designOptionsTypeGuid)
Detailed Description
Functions related to the Design Options, Design Option Combinations, and Design Option - View connection.
Function Documentation
◆ CheckCreationRights()
 static std::optional< Error > ACAPI::DesignOptions::DesignOptionsManipulationRightsChecker::CheckCreationRights  |  ( |   | )
static
Returns
An error if design option/design option set/design option combination creation is not allowed
Since
Archicad 29
◆ CheckModificationAndDeletionRights()
 static std::optional< Error > ACAPI::DesignOptions::DesignOptionsManipulationRightsChecker::CheckModificationAndDeletionRights  |  ( |  const GS::Guid & |  designOptionsTypeGuid | )
static
Returns
An error if design option/design option set/design option combination modification/deletion is not allowed.
Parameters
designOptionsTypeGuid | The guid of the design option/design option set/design option combination to check
Since
Archicad 29
◆ CheckProjectExistanceAndWindowType()
 static std::optional< Error > ACAPI::DesignOptions::DesignOptionsManipulationRightsChecker::CheckProjectExistanceAndWindowType  |  ( |   | )
static
Returns
An error if there is no opened project, or if the given window type is not Design Options compatible
Since
Archicad 29
◆ CreateDesignOptionManager()
 Result< DesignOptionManager > ACAPI::DesignOptions::CreateDesignOptionManager  |  ( |   | )
inline
A function to create design option manager instance, that lets you query and manipulate design option related data.
Returns
The design option manager instance.